tap "1password/tap"
tap "derailed/k9s"
tap "homebrew-ffmpeg/ffmpeg"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "rfidresearchgroup/proxmark3"
tap "twilio/brew"
brew "python@3.11"
brew "ansible"
brew "webp"
brew "argon2"
brew "aria2"
brew "autoconf"
brew "automake"
brew "borgbackup"
brew "ccache"
brew "certbot"
brew "consul-template"
brew "croc"
brew "direnv"
brew "exiftool"
brew "unbound"
brew "gnutls"
brew "tesseract"
brew "ffmpeg"
brew "fswatch"
brew "git-filter-repo"
brew "guile"
brew "libusb"
brew "gnupg"
brew "git-secret"
brew "go"
brew "graphviz"
brew "grep"
brew "grepcidr"
brew "htop"
brew "iperf3"
brew "jq"
brew "lastpass-cli"
brew "libmagic"
brew "libpq"
brew "libusb-compat"
brew "protobuf"
brew "mosh"
brew "mtr"
brew "nginx"
brew "nmap"
brew "node"
brew "nomad"
brew "nvm"
brew "oci-cli"
brew "p7zip"
brew "packer"
brew "pbzip2"
brew "pfetch"
brew "sbcl"
brew "pgloader"
brew "postgresql@14", restart_service: true
brew "pv"
brew "pyenv"
brew "python@3.10"
brew "qemu"
brew "qt@5"
brew "rclone"
brew "redis"
brew "ripgrep"
brew "rpm"
brew "rsync"
brew "rustup-init"
brew "smartmontools"
brew "sponge"
brew "telnet"
brew "terraform"
brew "thefuck"
brew "vault"
brew "watch"
brew "wget"
brew "wireguard-tools"
brew "wrk"
brew "x86_64-elf-gcc"
brew "youtube-dl"
brew "zlib"
brew "derailed/k9s/k9s"
brew "rfidresearchgroup/proxmark3/proxmark3", args: ["with-generic"]
brew "twilio/brew/twilio"
cask "1password-cli"
cask "blackhole-2ch"
cask "firefox-developer-edition"
cask "gitup"
cask "iterm2-nightly"
cask "jetbrains-toolbox"
cask "ngrok"
cask "openlens"
cask "rar"
cask "swiftdefaultappsprefpane"
cask "visual-studio-code-insiders"
cask "vlc"
